#!/usr/bin/env python3

import sys

sys.dont_write_bytecode = True

from pathlib import Path
import os
import yaml
import re

current_script_path = Path(__file__).parent
utils_path = current_script_path.parent.parent / 'script'
sys.path.append(str(utils_path))

from utils import scriptutils

scriptutils.assert_root()
script_dir = str(Path(__file__).parent.resolve())

# папка, где находятся конфиги
config_path = current_script_path.parent.parent / 'configs'

# если отсутствуют файлы-конфиги
if len(os.listdir(config_path)) == 0:
    print(
        scriptutils.warning(
            "Отсутствуют конфиг-файлы в директории configs/.. - миграция не требуется. Запустите скрипт create_configs.py для создания конфиг-файлов и заполните поля"
        )
    )
    exit(0)

auth_config_path = str(config_path) + "/auth.yaml"
if False == os.path.exists(auth_config_path):
    print(
        scriptutils.warning(
            "Отсутствует конфиг-файл auth.yaml в директории configs/.. - миграция не требуется. Запустите скрипт create_configs.py для создания конфиг-файлов и заполните поля"
        )
    )
    exit(0)

# если конфиг auth.yaml уже содержит свежие поля
with open(auth_config_path, "r") as file:
    # считываем конфиг
    auth_config = yaml.safe_load(file) or {}

    # если в содержимом уже имеется новое поле, то ничего не делаем
    if "smsaero.provide_phone_code_list" in auth_config:
        print(scriptutils.success("Конфиг-файл auth.yaml выглядит актуальным, миграция не требуется."))
        exit(0)

# читаем содержимое файла
with open(auth_config_path, "r") as file:
    content = file.read().rstrip()

# добавляем актуальный параметр в конец конфига
content += f"""

# Настройки SMS-оператора SMS Aero

# Массив обслуживаемых префиксов. Система оперирует номерами в международном формате и
# при выборе оператора опирается на префикс номера. Данный параметр определяет список
# обслуживаемых провайдером префиксов. Например для обслуживания номеров Казахстана необходимо
# указать префиксы "+796" и "+797", для белорусских "+375", а при обслуживании вообще
# всех номеров только "+".
#
# Тип данных: массив строк, пример: ["+796", "+797", "+375"]
smsaero.provide_phone_code_list:

# Массив приоритетных обслуживаемых префиксов. Если один префикс закреплен за несколькими
# провайдерами, то система отдаст приоритет тому провайдеру, у которого префикс находится
# в списке приоритетных.
# Логика ввода значений аналогична логике поля provide_phone_code_list.
# Поле не является обязательным для заполнения.
#
# Тип данных: массив строк, пример: ["+796", "+797"]
smsaero.high_priority_phone_code_list:

# Минимальный уровень баланса на счете оператора, после которого он перестает использоваться
# для рассылки SMS-сообщений. В большинстве случаев стоит оставить небольшой запас,
# чтобы счет не уходил в минус.
# В качестве валюты используется валюта счета, предоставленного SMS-провайдером.
#
# Тип данных: число
smsaero.min_balance_value:

# Точка входа, куда система будет отправлять API-запросы для рассылки SMS-сообщений.
# В большинстве случаев адрес по умолчанию является актуальными и не требует изменений.
#
# Тип данных: строка
smsaero.provider_gateway_url: "https://gate.smsaero.ru/v2/"

# Имя приложения, используемого при отправке сообщений.
# Для получателя SMS будет являться отправителем.
#
# Тип данных: строка
smsaero.app_name:

# Email, который используется для авторизации в API SMS-провайдера.
#
# Тип данных: строка
smsaero.email:

# Ключ, который будет использоваться для авторизации в API SMS-провайдера.
# Ключ выдается при оформлении договора c SMS-провайдером.
# В документации подключения провайдера обозначен как API key.
#
# Тип данных: строка
smsaero.api_key:

# Настройки SMS-оператора SMSC

# Массив обслуживаемых префиксов. Система оперирует номерами в международном формате и
# при выборе оператора опирается на префикс номера. Данный параметр определяет список
# обслуживаемых провайдером префиксов. Например для обслуживания номеров Казахстана необходимо
# указать префиксы "+796" и "+797", для белорусских "+375", а при обслуживании вообще
# всех номеров только "+".
#
# Тип данных: массив строк, пример: ["+796", "+797", "+375"]
smsc.provide_phone_code_list:

# Массив приоритетных обслуживаемых префиксов. Если один префикс закреплен за несколькими
# провайдерами, то система отдаст приоритет тому провайдеру, у которого префикс находится
# в списке приоритетных.
# Логика ввода значений аналогична логике поля provide_phone_code_list.
# Поле не является обязательным для заполнения.
#
# Тип данных: массив строк, пример: ["+796", "+797"]
smsc.high_priority_phone_code_list:

# Минимальный уровень баланса на счете оператора, после которого он перестает использоваться
# для рассылки SMS-сообщений. В большинстве случаев стоит оставить небольшой запас,
# чтобы счет не уходил в минус.
# В качестве валюты используется валюта счета, предоставленного SMS-провайдером.
#
# Тип данных: число
smsc.min_balance_value:

# Точка входа, куда система будет отправлять API-запросы для рассылки SMS-сообщений.
# В большинстве случаев адрес по умолчанию является актуальными и не требует изменений.
#
# Тип данных: строка
smsc.provider_gateway_url: "https://smsc.ru/sys/"

# Имя приложения, используемого при отправке сообщений.
# Для получателя SMS будет являться отправителем.
#
# Тип данных: строка
smsc.app_name:

# Ключ, который будет использоваться для авторизации в API SMS-провайдера.
# Ключ выдается при оформлении договора c SMS-провайдером.
# В документации подключения провайдера обозначен как API key.
#
# Тип данных: строка
smsc.api_key:

"""

# сохраняем изменения
auth_config = open(auth_config_path, "w")
auth_config.write(content)
auth_config.close()
